Revit 2024 API
ParameterTypeId.DuctTerminalEngagementLength Property
 "Engagement Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DuctTerminalEngagementLength { get; }
Visual Basic
Public Shared ReadOnly Property DuctTerminalEngagementLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DuctTerminalEngagementLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace